import { Component, OnInit } from '@angular/core';
import { ActivatedRoute } from '@angular/router';

@Component({
  selector: 'app-detail-new',
  templateUrl: './detail-new.component.html',
  styleUrls: ['./detail-new.component.css']
})
export class DetailNewComponent implements OnInit {

  moc_data = [
    {
      "detail_id": 1,
      "name": "เกียรติสินเดลิเวอรี่",
      "date": "08/10/20",
      "by": "เกียรติสิน",
      "link":"",
      "detail": [
        "บริษัทเกียรติสินโฮลเซล ได้จัดทำบริการส่งสินค้าแบบเดลิเวอรี่ ขึ้นเป็นทางเลือกใหม่เพื่อความสะดวกสบายสำหรับลูกค้าบริเวณพื้นที่ใกล้เคียง โดยที่ลูกค้าไม่ต้องเดินทางมาซื้อสินค้าด้วยตนเอง เพียงแค่ลูกค้าสั่งสินค้า ผ่านทาง Inbox (แชทเพจของร้าน) และแจ้งพิกัดหรือที่อยู่ จะมีพนักงานของร้านนำสินค้าไปส่งให้กับลูกค้าถึงหน้าบ้านทันที (*เงื่อนไขเป็นไปตามที่ทางร้านกำหนด)",
        "เดลิเวอรี่ เป็นบริการการส่งสินค้าที่ตอนนี้ได้รับความนิยมสูงมากในหมู่ลูกค้าออนไลน์เพราะบริการนี้จะช่วยเพิ่มความสะดวกสบาย โดยที่ลูกค้าแทบไม่ต้องออกจากบ้านไปต่อคิวหรือขับรถวนหาที่จอดให้เสียเวลา ทางร้านจึงจัดทำบริการนี้ขึ้นเพื่ออำนวยความสะดวก ให้กับลูกค้าบริเวรใกล้เคียง โดยที่ลูกค้าสามารถสั่งซื้อสินค้าได้ที่ช่องทาง แชทเพจ เฟสบุ๊ค เกียรติสินโฮลเซล Kiatsinwholesale และแจ้งที่อยู่ ก็จะมีพนักงานของร้านเรานำสินค้าไปส่งให้กับลูกค้าจนถึงหน้าบ้าน หรือกดที่ลิงก์ ",
        "https://www.facebook.com/kiatsinwholesalebanphai เพื่อติดตามข่าวสารและโปรโมชันอื่นๆ อีกมากมาย ทางเราได้อัพเดตการจัดเตรียมข้อมูลและสินค้าไว้คอยบริการอยู่เสมอ เพื่อให้ลูกค้าทุกท่านประทับใจเมื่อเลือกใช้บริการของเรา",
      ]
    },
    {
      "detail_id": 2,
      "name": "เกียรติสินฝากความห่วงใย",
      "date": "09/010/20",
      "by": "เกียรติสิน",
      "detail": [
        "สภาพอากาศในช่วงปลายฝนต้นหนาวนั้นเป็นภาพอากาศที่แปรปรวน หนาวเย็น และบางพื้นที่อาจมีฝนตก ในช่วงที่สภาพอากาศเช่นนี้ ร่างกายอาจปรับตัวไม่ทันจึงทำให้เกิดโรคต่างๆ ขึ้นได้ง่าย โดยเฉพาะในกลุ่มเด็กเล็กและผู้สูงอายุ ดังนั้นจึงต้องระมัดระวังการเจ็บป่วย เป็นไข้ในช่วงนี้ ทางร้านจึงขอให้ลูกค้าทุกๆ ท่านดูแลรักษาสุขภาพให้แข็งแรง โดยการออกกำลังกาย รับประทานอาหารที่มีประโยชน์ พักผ่อนให้เพียงพอ และที่สำคัญควรใส่เสื้อผ้าให้ร่างกายอบอุ่นอยู่เสมอ สำหรับท่านที่มีโรคประจำตัวควรทานยาอย่างต่อเนื่อง เพื่อควบคุมอาการของโรคเดิมให้ปกติ ",
       "ทางบริษัทได้เล็งเห็นความสำคัญของการรักษาสุขภาพในช่วงที่อากาศเปลี่ยนแปลง จึงมีความประสงค์ที่จะนำเสนอกิจกรรมทางเลือกมาให้กับลูกค้าทุกท่าน ดังนี้",
       "-  ดูแลรักษาสุขภาพตัวเองและทุกคนในครอบครัวให้แข็งแรงโดยการออกกำลังกายอย่างสม่ำเสมอ เพราะจะทำให้ร่างแข็งแรงต้านทานต่อสู้กับเชื้อโรคต่างๆ ได้ เช่น การเดิน การวิ่งเหยาะๆ การปั่นจักรยาน การเล่นกีฬาที่มีการเคลื่อนไหวอย่างต่อเนื่อง นอกจากนั้นยังทำให้ร่างกายมีความอบอุ่นมากขึ้น",
       "-  รับประทานอาหารให้ครบ 5 หมู่ โดยทานโปรตีน คาร์โบไฮเดรต เกลือแร่ วิตามิน และไขมัน ในสัดส่วนที่เหมาะสม",
       "-  ควรนอนพักผ่อนให้เพียงพอ อย่างน้อยวันละ 8 ชั่วโมง เพื่อให้ร่างกายมีความสดชื่นและลดอาการตึงเครียด อ่อนเพลีย และวิงเวียนศีรษะ",
       "-  ควรดื่มน้ำวันละ 6-8 แก้ว เพื่อให้ร่างกายได้รับความชุ่มชื่นและเป็นการช่วยขับสารพิษออกจากร่างกายอีกด้วย",
       "ทางบริษัทเกียรติสินโฮลเซลขอขอบคุณลูกค้าทุกท่านที่ให้การสนับสนุนร้านค้ามาเป็นเวลานาน ทางร้านจึงอยากตอบแทนลูกค้าทุกท่านผ่านตัวอักษรในหัวข้อนี้เพื่อแสดงถึงความห่วงใยและเอาใส่ใจลูกค้าทุกท่าน ขอขอบคุณจากใจจริง"
      ]
    },
    {
      "detail_id": 3,
      "name": "รณรงค์ลดการใช้ถุงพลาสติก",
      "date": "10/10/20",
      "by": "เกียรติสิน",
      "detail": [
       "เกียรติสินโฮลเซลได้ร่วมรณรงค์ ลดการใช้ถุงพลาสติกผ่านแคมเปญ Everyday Say No to Plastic Bags ที่เริ่มตั้งแต่วันที่ 1มกราคม 2563 ทางร้านเกียรติสินโฮลเซลได้จัดเตรียมความพร้อม โดยแนะนำลูกค้าให้ใช้ถุงผ้า หรือ ถุงกระดาษแทน และทางร้านได้นำลังกระดาษมาใช้ในการใส่สินค้าแทนการใส่ถุงพลาสติก  ",
       "การรณรงค์ลดการใช้ถุงพลาสติก จัดขึ้นเพื่อสร้างความตระหนักให้กับประชาชนได้เข้าใจถึงปัญหาที่ส่งผลกระทบต่อสิ่งแวดล้อม และสร้างการมีส่วนร่วมระหว่างภาครัฐ ภาคเอกชน และประชาชน เพื่อช่วยกันลดปริมาณขยะ โดยเฉพาะลดการใช้พลาสติก ส่งเสริมให้ประชาชนหันมาใช้ถุงผ้าแทนถุงพลาสติก ภาครัฐและภาคเอกชนได้ขอความร่วมมือกับห้างสรรพสินค้า ซุปเปอร์มาร์เก็ต และ ร้านสะดวกซื้อ งดให้ถุงพลาสติกกับลูกค้า โดยให้ลูกค้านำถุงผ้า หรือ ภาชนะอย่างอื่นมาใส่สินค้าเอง เกียรติสินได้ร่วมรณรงค์ ลดการใช้ถุงพลาสติก ตั้งแต่วันที่ 1มกราคม 2563 ทางร้านได้จัดเตรียมความพร้อม และยังให้ความยืดหยุ่นให้แก่ลูกค้า โดยการนำกล่องลังกระดาษ มาใส่สินค้าแทนการใช้ถุงพลาสติกและแนะนำลูกค้า ให้หันมาใช้ถุงผ้าแทน หากลูกค้าซื้อสินค้าปริมาณที่เยอะ ทางร้านได้จัดเตรียมรถเข็น และ มีพนักงานคอยส่งสินค้า เพื่ออำนวยความสะดวกให้แก่ลูกค้าที่มาใช้บริการทุกท่านค่ะ"
      ]
    }
  ]

  show_data: any
  constructor(
    private route: ActivatedRoute
  ) { }
  ngOnInit(): void {
    this.route.queryParams.subscribe(params => {
      this.moc_data.forEach(element => {
        if (element.detail_id == params["ID"]) {
          this.show_data = element;
        }
      });
    });
  }

}
